/************************************************************************
	v1.0	修改RTC_setClock错误			//  [1/26/2018 Administrator]
	v1.1 	增加BCDtoInt					// 	20180222
************************************************************************/
#ifndef __RTC_DS1302__
#define __RTC_DS1302__
/*----------------------------------------------------------------------- */
#include "stm32f10x.h"

#define BCDtoInt(n)	((((n)>>4)&0xf)*10) + ((n)&0xf)

#define DS1302			1 		//使用外部RTC

/*----------------------------------------------------------------------- */
void RTC_init(void);
void RTC_setClock(u8 clock[6]);  	//BCD格式
void RTC_getClock(u8 *recbuf);  	//BCD格式


#endif //__RTC_DS1302__


