
/****************************************Copyright (c)****************************************************
**                               深圳市万全智能技术有限公司                                             **
**                                                                                                      **
**                                 http://www.szeway.cn                                                 **
**                                                                                                      **
**--------------File Info-------------------------------------------------------------------------------**
** File Name:               WG.h                                                                        **
** Last modified Date:      2012.7.24                                                                   **
** Last Version:            v1.0                                                                        **
** Description:             WG通信模块                                                                  **
**                                                                                                      **
**------------------------------------------------------------------------------------------------------**
** Created By:              刘飞                                                                        **
** Created date:            2012.7.24                                                                   **
** Version:                 v1.0                                                                        **
** Descriptions:            The original version 初始版本                                               **
**                                                                                                      **
**------------------------------------------------------------------------------------------------------**
** Modified by:                                                                                         **
** Modified date:                                                                                       **
** Version:                                                                                             **
** Description:                                                                                         **
**                                                                                                      **
*********************************************************************************************************/
#ifndef _WG_H
			
#define _WG_H

/////////////////////////////////////////////////////////////////////////////////////////////////////////

void packetDataWG26(unsigned char *ch);
void packetDataWG34(unsigned char *ch);
void packetDataWG261(unsigned char *ch);
void packetDataWG341(unsigned char *ch);

#endif

